#print() - გამოიყენება იმისთვის , რომ ტერმინალში გამოვიტანოთ კოდი,მაგალითად შევამოწმოთ შექმნილი პროგრამები ან ვიექსპერიმენტოთ

#print("Hello World!") #string
#print(110) #integer


# + - მიმატება,
# (გამოკლება),
# ,
# გამრავლება,
# ,

# /-// - გაყოფა (2 ტიპი),
# % - ნაშთის გამოსათვლელად,
# / - ამის დახმარებით , საბოლოო პასუხს მივიღებთ ათწილადს.,
# // - ამის დახმარებით ,  საბოლოო პასუხს მივიღებთ მთელ რიცხვს (დამრგვალებულს, ჩამოშორდება 'წერტილი' - ს შემდეგ არსებული რიცხვები (დამრგვალდება)),
#print( 10 + 10 )
#print( 50 - 20 )
#print( 50 * 2 )
#print( 100 / 5 )
#print( 100 // 5 )


#print( 7 / 3 )
#print( 7 // 3 ) 


#print( 'face' + 'book' )
#print( 'dis' + 'cord' )

#როდესაც სიტყვებს ერთმანეთზე ვამატებთ,მაგას ეწოდება 'კონკატინაცია'

#text/ტექსტი - string/სტრინგი . . . . 'ეს არის სტრინგის მაგალითი'
#number/რიცხვი - integer/ინტეჯერი - 10, 20, 30, 40 . . . . . . . .

#print('hello world')
#print("hello world")

#print("hello my name is gabriel and i'm from georgia")
#print("this is final moment , will you say 'yes' :>")

#მონაცემთა ტიპები - string,boolean,integer,list,float . . . . . . . .

#print("hello" + ' ' + str(100) + ' ' + "zdarova chemi dzma")



