//Backend არის პროგრამის სერვერული ნაწილი, რომელიც ამუშავებს მომხმარებლის მოთხოვნებს, მუშაობს ბაზასთან და აბრუნებს შედეგს Frontend-ში.

//მაგალითად:
 //თუ მომხმარებელი შედის საიტზე და ლოგინს აკეთებს, backend ამოწმებს მონაცემებს ბაზაში და აგზავნის პასუხს სწორია თუ არა.

 // მოკლე დასკვნა:
 //Backend არის ვებსაიტის ან აპლიკაციის სერვერული ნაწილი, რომელიც პასუხისმგებელია მონაცემების დამუშავებაზე, შენახვაზე და Frontend-თან კომუნიკაციაზე.

 //Backend პროგრამირების ენები                                                                                                             

//Backend-ისთვის გამოიყენება სხვადასხვა ენა:

//JavaScript (Node.js)

//Python

//Java

//PHP

//C#