 #შექმენით პროგრამა სტუდენტების ქულების მართვისთვის:

#•    შექმენით dictionary სტრუქტურა სადაც:
#Key არის სტუდენტის სახელი,
#Value არის მისი ქულების სია (მინიმუმ 5 საგნის ქულა),
#•    შექმენით ფუნქციები:
#calculate_average(scores) - ითვლის საშუალო ქულას,
#get_grade(average) - აბრუნებს შეფასებას (A: 91-100, B: 81-90, C: 71-80, D: 61-70, E: 51-60, FX: 41-50, F: 0-40),
#find_top_student(students_dict) - პოულობს საუკეთესო სტუდენტს,
#•    მინიმუმ 5 სტუდენტისთვის:
#გამოთვალეთ საშუალო ქულა,
#განსაზღვრეთ შეფასება,
#დაალაგეთ სტუდენტები საშუალო ქულის მიხედვით (კლებადობით),
#•    შედეგები გამოიტანეთ ფორმატირებული სახით

